
locations = { countries:
	[
		{ name: "Украина", states: 
			[
				{ name: "Киевская", cities: ["Белая Церковь",
					"Березань","Богуслав","Борисполь","Боярка", "Бровары",
					"Буча", "Васильков", "Вишневое", "Вышгород","Ирпень",
					"Кагарлык", "Киев", "Мироновка", "Обухов",
					"Переяслав-Хмельницкий", "Припять", "Ржищев","Сквира",
					"Славутич", "Тараща", "Тетиев", "Узин", "Украинка",
					"Фастов", "Чернобыль", "Яготин"]},
				{ name: "Черниговская", cities: ["Батурин", "Бахмач",
					"Бобровица", "Борзна", "Городня", "Ичня", "Корюковка",
					"Мена", "Нежин", "Новгород-Северский", "Носовка",
					"Остёр","Прилуки", "Семёновка", "Сновск", "Чернигов"]},
				{ name: "Одесская", cities: ["Ананьев", "Арциз", "Балта",
				 	"Белгород-Днестровский", "Беляевка", "Березовка",
				 	"Болград", "Вилково", "Измаил", "Килия", "Кодыма",
				 	"Одесса", "Подольск", "Раздельная", "Рени", "Татарбунары",
				 	"Теплодар", "Черноморск", "Южное"]},
				{ name: "Днепропетровская", cities: ["Апостолово", "Верховцево",
					"Верхнеднепровск", "Вольногорск", "Днепр", "Жёлтые Воды",
					"Зеленодольск", "Каменское", "Кривой Рог", "Марганец",
					"Никополь", "Новомосковск", "Покров", "Павлоград",
					"Перещепино", "Першотравенск", "Подгородное", "Пятихатки",
					"Синельниково", "Терновка"]},
				{ name: "Харьковская", cities: ["Балаклея", "Барвенково",
					"Богодухов", "Валки", "Волчанск", "Дергачи", "Змиёв",
					"Изюм", "Красноград", "Купянск", "Лозовая", "Люботин",
					"Мерефа", "Первомайский", "Пивденное", "Харьков", "Чугуев"]},
				{ name: "Житомирская", cities: ["Андрушёвка", "Барановка",
					"Бердичев", "Житомир", "Коростень", "Коростышев", "Малин",
					"Новоград-Волынский", "Овруч", "Олевск", "Радомышль",
					"Чуднов"]},
				{ name: "Полтавская", cities: ["Гадяч", "Глобино", "Гребёнка",
					"Горишние Плавни", "Заводское", "Зеньков", "Карловка",
					"Кобеляки", "Кременчуг", "Лохвица", "Лубны", "Миргород",
					"Пирятин", "Полтава", "Хорол"]},
				{ name: "Херсонская", cities: ["Алёшки", "Берислав", "Геническ",
					"Голая Пристань", "Каховка", "Новая Каховка", "Скадовск",
					"Таврийск", "Херсон"]},
				{ name: "Запорожская", cities: ["Бердянск", "Васильевка",
					"Вольнянск", "Гуляйполе", "Днепрорудное", "Запорожье",
					"Каменка-Днепровская", "Мелитополь", "Молочанск", "Орехов",
					"Пологи", "Приморск", "Токмак", "Энергодар"]},
				{ name: "Луганская", cities: ["Александровск", "Алмазная",
					"Алчевск", "Антрацит", "Боково-Хрустальное", "Брянка",
					"Вознесеновка", "Голубовка", "Горское", "Должанск",
					"Зимогорье", "Золотое", "Зоринск", "Ирмино", "Кадиевка",
					"Кипучее", "Кременная", "Лисичанск", "Луганск", "Лутугино",
					"Миусинск", "Молодогвардейск", "Новодружеск", "Первомайск",
					"Перевальск", "Петрово-Красноселье", "Попасная", "Приволье",
					"Ровеньки", "Рубежное", "Сватово", "Сорокино", "Северодонецк",
					"Старобельск", "Суходольск", "Счастье", "Хрустальный"]},
				{ name: "Донецкая", cities: ["Авдеевка", "Амвросиевка", "Бахмут",
					"Белицкое", "Белозёрское", "Волноваха", "Горловка", "Горняк",
					"Дебальцево", "Доброполье", "Докучаевск", "Донецк",
					"Дружковка", "Енакиево", "Ждановка", "Железное", "Зугрэс",
					"Иловайск", "Кировское", "Комсомольское", "Константиновка",
					"Краматорск", "Красноармейск", "Красногоровка", "Красный Лиман",
					"Курахово", "Макеевка", "Мариуполь", "Марьинка", "Мирноград",
					"Моспино", "Николаевка", "Новоазовск", "Новогродовка",
					"Родинское",	"Светлодарск", "Святогорск", "Северск", "Селидово",
					"Славянск", "Снежное", "Соледар", "Торез", "Торецк", "Углегорск",
					"Угледар", "Украинск", "Харцызск", "Часов Яр", "Шахтёрск",
					"Юнокоммунаровск", "Ясиноватая"]},
				{ name: "Винницкая", cities: ["Бар", "Бершадь", "Винница", "Гайсин",
					"Гнивань", "Жмеринка", "Ильинцы", "Казатин", "Калиновка", "Ладыжин",
					"Липовец", "Могилёв-Подольский", "Немиров", "Погребище", "Тульчин",
					"Хмельник", "Шаргород", "Ямполь"]},
				{ name: "Кировоградская", cities: ["Александрия", "Благовещенское",
					"Бобринец", "Гайворон", "Долинская", "Знаменка", "Кропивницкий",
					"Малая Виска", "Новомиргород", "Новоукраинка", "Помошная",
					"Светловодск"]},
				{ name: "Николаевская", cities: ["Баштанка", "Вознесенск",
					"Николаев", "Новая Одесса", "Новый Буг", "Очаков", "Первомайск",
					"Снигирёвка", "Южноукраинск"]},
				{ name: "Сумская", cities: ["Ахтырка", "Белополье", "Бурынь",
					"Ворожба", "Глухов", "Дружба", "Конотоп", "Кролевец", "Лебедин",
					"Путивль", "Ромны", "Середина-Буда", "Сумы", "Тростянец", "Шостка"]},
				{ name: "Львовская", cities: ["Белз", "Бобрка", "Борислав", "Броды",
					"Буск", "Великие Мосты", "Винники", "Глиняны", "Городок", "Добромиль",
					"Дрогобыч", "Дубляны", "Жидачов", "Жолква", "Золочев", "Каменка-Бугская",
					"Комарно", "Львов", "Моршин", "Мостиска", "Николаев", "Новояворовск",
					"Новый Калинов", "Новый Роздол", "Перемышляны", "Пустомыты", "Рава-Русская",
					"Радехов", "Рудки", "Самбор", "Сколе", "Сокаль", "Сосновка", "Старый Самбор",
					"Стебник", "Стрый", "Судовая Вишня", "Трускавец", "Турка", "Угнев", "Ходоров",
					"Хыров", "Червоноград", "Яворов"]},
				{ name: "Черкасская", cities: ["Ватутино", "Городище", "Жашков", "Звенигородка",
					"Золотоноша", "Каменка", "Канев", "Корсунь-Шевченковский", "Монастырище",
					"Смела", "Тальное", "Умань", "Христиновка", "Черкассы", "Чигирин", "Шпола"]},
				{ name: "Хмельницкая", cities: ["Волочиск", "Городок", "Деражня", "Дунаевцы",
					"Изяслав", "Каменец-Подольский", "Красилов", "Нетешин", "Полонное", "Славута",
					"Староконстантинов", "Хмельницкий", "Шепетовка"]},
				{ name: "Волынская", cities: ["Берестечко", "Владимир-Волынский", "Горохов",
					"Камень-Каширский", "Киверцы", "Ковель", "Луцк", "Любомль", "Нововолынск",
					"Рожище", "Устилуг"]},
				{ name: "Ровенская", cities: ["Березно", "Дубно", "Дубровица",
					"Здолбунов", "Корец", "Костополь", "Вараш", "Острог", "Радивилов",
					"Ровно", "Сарны"]},
				{ name: "Ивано-Франковская", cities: ["Болехов", "Бурштын", "Галич",
					"Городенка", "Долина", "Ивано-Франковск", "Калуш", "Коломыя",
					"Косов", "Надворная", "Рогатин", "Снятын", "Тлумач", "Тысменица",
					"Яремче"]},
				{ name: "Тернопольская", cities: ["Бережаны", "Борщёв", "Бучач",
					"Залещики", "Збараж", "Зборов", "Копычинцы", "Кременец",
					"Лановцы", "Монастыриска", "Подгайцы", "Почаев", "Скалат",
					"Теребовля", "Тернополь", "Хоростков", "Чортков", "Шумск"]},
				{ name: "Закарпатская", cities: ["Берегово", "Виноградов",
					"Иршава", "Мукачево", "Перечин", "Рахов", "Свалява", "Тячев",
					"Ужгород", "Хуст", "Чоп"]},
				{ name: "Черновицкая", cities: ["Вашковцы", "Вижница", "Герца",
					"Заставна", "Кицмань", "Новоднестровск", "Новоселица", "Сокиряны",
					"Сторожинец", "Хотин", "Черновцы"]}
			] 
		}#,
		#{ name: "Россия", states: 
			#[
				#{ name: "Новгородская", cities: ["Боровичи", "Валдай",
				#	"Великий Новгород", "Малая Вишера", "Окуловка",
				#	"Пестово", "Сольцы", "Старая Русса", "Холм","Чудово"]}
			#] 
		#},
		#{ name: "Белоруссия", states: []}
	]
}

ActiveRecord::Base.transaction do
	locations[:countries].each do |country|
		Country.create(name: country[:name]) unless Country.find_by(name: country[:name])
		country[:states].each do |state|
			if state[:name]
				State.create(name: state[:name], 
					country_id: Country.find_by(name: country[:name]).id) unless State.find_by(name: state[:name])
				if state[:cities]
					state[:cities].each do |city|
						City.create(name: city, 
							state_id: State.find_by(name: state[:name]).id) unless City.find_by(name: city)
					end
				end
			end
		end
	end
end

if User.count < 0 
	ActiveRecord::Base.transaction do
		100.times do |i|
			firstName = Faker::Name.first_name
			User.create!(
				first_name: firstName,
				last_name: Faker::Name.last_name,
				email: firstName + i.to_s + "@#{Faker::Internet.domain_name}",
				password: "testpass",
				password_confirmation: "testpass",
				confirmed_at: Time.now
			)
		end
	end
end